---
kind: enumMember
id: F:Autodesk.Revit.DB.SunAndShadowType.MultiDayStudy
enum: Autodesk.Revit.DB.SunAndShadowType
source: html/0f990e60-7c79-7a25-42e5-7cfe6abe5b23.htm
---
# Autodesk.Revit.DB.SunAndShadowType.MultiDayStudy

Multi day study type (range over date and time).